In [22]:
import pandas as pd
import numpy as np

In [19]:
#5.1.1一维数组Series

In [ ]:
#数据和索引

In [3]:
obj=pd.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj2=pd.Series([4,7,-5,3],index=['d','b','a','c'])#自定义索引值

In [11]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [14]:
obj2['a']

-5

In [15]:
obj2['d']

4

In [16]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [17]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [20]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [23]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [24]:
'b' in obj2

True

In [25]:
'e'in obj2

False

In [26]:
#通过字典创建Series

In [28]:
sdata={'Ohio':35000,'Texas':71000,'Oergon':16000,'Utah':5000}

In [29]:
obj3=pd.Series(sdata)

In [35]:
obj3

Ohio      35000
Texas     71000
Oergon    16000
Utah       5000
dtype: int64

In [36]:
 states=['California','Ohio','Oergon','Texas']

In [37]:
obj4=pd.Series(sdata,index=states)

In [38]:
obj4

California        NaN
Ohio          35000.0
Oergon        16000.0
Texas         71000.0
dtype: float64

In [39]:
pd.isnull(obj4)

California     True
Ohio          False
Oergon        False
Texas         False
dtype: bool

In [40]:
pd.notnull(obj4)

California    False
Ohio           True
Oergon         True
Texas          True
dtype: bool

In [41]:
obj4.isnull()

California     True
Ohio          False
Oergon        False
Texas         False
dtype: bool

In [42]:
obj4.notnull()

California    False
Ohio           True
Oergon         True
Texas          True
dtype: bool

In [43]:
obj3

Ohio      35000
Texas     71000
Oergon    16000
Utah       5000
dtype: int64

In [44]:
obj4

California        NaN
Ohio          35000.0
Oergon        16000.0
Texas         71000.0
dtype: float64

In [45]:
obj3+obj4

California         NaN
Oergon         32000.0
Ohio           70000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [46]:
obj4.name='population'#对象自身和索引的name属性

In [47]:
obj4.index.name='state'#?name属性的作用

In [48]:
obj4

state
California        NaN
Ohio          35000.0
Oergon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [49]:
#按位赋值改变索引

In [50]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [51]:
obj.index=['Bob','Steve','Jeff','Ryan']

In [52]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [53]:
#5.1.2 矩阵DataFrame

In [57]:
data={'name':['lzy','hqy','hmt','lq','cl'],
      'old':[22,21,23,24,18],
      'score':[89,99,95,60,73]}

In [58]:
data

{'name': ['lzy', 'hqy', 'hmt', 'lq', 'cl'],
 'old': [22, 21, 23, 24, 18],
 'score': [89, 99, 95, 60, 73]}

In [59]:
data

{'name': ['lzy', 'hqy', 'hmt', 'lq', 'cl'],
 'old': [22, 21, 23, 24, 18],
 'score': [89, 99, 95, 60, 73]}

In [60]:
frame=pd.DataFrame(data)

In [61]:
frame

  name  old  score
0  lzy   22     89
1  hqy   21     99
2  hmt   23     95
3   lq   24     60
4   cl   18     73

In [62]:
frame.head()

  name  old  score
0  lzy   22     89
1  hqy   21     99
2  hmt   23     95
3   lq   24     60
4   cl   18     73

In [63]:
pd.DataFrame(data,columns=['old','score','name'])

   old  score name
0   22     89  lzy
1   21     99  hqy
2   23     95  hmt
3   24     60   lq
4   18     73   cl

In [64]:
frame2=pd.DataFrame(data,columns=['name','id','score'])

In [65]:
frame2

  name   id  score
0  lzy  NaN     89
1  hqy  NaN     99
2  hmt  NaN     95
3   lq  NaN     60
4   cl  NaN     73

In [66]:
frame2['name']

0    lzy
1    hqy
2    hmt
3     lq
4     cl
Name: name, dtype: object

In [67]:
frame2.name

0    lzy
1    hqy
2    hmt
3     lq
4     cl
Name: name, dtype: object